In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [14]:
# go back to grand parent level directory
path = os.path.abspath(os.getcwd() + "/../../")

C:\Users\Sonia\OneDrive - Imperial College London\ba_aib_group4_oc-gym

The ratecard spreadsheet contains 2 tables. We split them into 2 csv files and save them under data/processed/
![title](ratecard_layout.jpg)

In [12]:
# import client data
client_price = pd.read_csv(os.path.join(path,'data/processed/client_price.csv'))
client_price.head()

   Year  Flexible  Standard  Joinee  Dayass
0  2009     25.99     20.99       5       6
1  2010     25.99     20.99       5       6
2  2011     25.99     20.99       5       6
3  2012     25.99     20.99       5       6
4  2013     25.99     20.99       5       6

In [13]:
# import competitor data
competitor_price = pd.read_csv(os.path.join(path,'data/processed/competitor_price.csv'))
competitor_price.head()

   Year  Flexible  Standard  Joinee
0  2009     35.99     30.99       8
1  2010     35.99     30.99       8
2  2011     35.99     30.99       8
3  2012     35.99     30.99       8
4  2013     35.99     30.99       8

In [16]:
# import subscription data
subscription = pd.read_csv(os.path.join(path,'data/raw/subscriptionsdataFINAL.csv'))
subscription.head()

,Club,Join Date,Affluence,Gender,Subscription Type,End Date,CustomerID,BirthYear
0,Enfield,Dec-11,C1,Male,Standard,Dec-11,1,1992
1,Greenwich,Jun-18,A,Female,Standard,NaN,2,1972
2,Islington,Mar-18,B,Female,Standard,Oct-18,3,1985
3,Hounslow,Oct-15,C1,Female,Standard,Dec-15,4,1972
4,Barnet,May-15,C2,Male,Standard,Dec-15,5,1982

Looks like there are several nan values here. We will need to take them into account when preparing the data.

- Also end date needs to be converted to datetime object

In [17]:
# import visit data
visit_1 = pd.read_csv(os.path.join(path,'data/raw/visitationdataPART1.csv'))
visit_2 = pd.read_csv(os.path.join(path,'data/raw/visitationdataPART2.csv'))

visit = pd.concat([visit_1, visit_2])
visit.head()

   CustomerID   visitdate TimeofVisit  peakvisits
0      126444  2009-05-01       05:45       False
1      456610  2009-05-01       05:45       False
2      293763  2009-05-01       06:00       False
3      151253  2009-05-01       06:15       False
4      476569  2009-05-01       06:15       False

In [22]:
visit['TimeofVisit'].describe()

count     69514576
unique          77
top          08:00
freq       2954244
Name: TimeofVisit, dtype: object

Time of visit needs to be converted to timestamp object